podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/ENET_S32K148.svd.xml
<!--
Devices using this peripheral: 
      S32K148
-->
      <peripheral>
         <?sourceFile "ENET_S32K148" ?>
         <name>ENET</name>
         <description>Ethernet MAC-NET Core</description>
         <groupName>ENET</groupName>
         <headerStructName>ENET</headerStructName>
         <baseAddress>0x40079000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x4</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x10</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x24</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x40</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x64</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x84</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xC4</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xE4</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x118</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x144</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x180</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x190</offset>
            <size>0x24</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x1C0</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x200</offset>
            <size>0x78</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x284</offset>
            <size>0x60</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x400</offset>
            <size>0x1C</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x604</offset>
            <size>0x24</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>EIR</name>
               <description>Interrupt Event Register</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>TS_TIMER</name>
                     <description>Timestamp Timer</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TS_AVAIL</name>
                     <description>Transmit Timestamp Available</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAKEUP</name>
                     <description>Node Wakeup Request Indication</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLR</name>
                     <description>Payload Receive Error</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UN</name>
                     <description>Transmit FIFO Underrun</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RL</name>
                     <description>Collision Retry Limit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LC</name>
                     <description>Late Collision</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EBERR</name>
                     <description>Ethernet Bus Error</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MII</name>
                     <description>MII Interrupt</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXB</name>
                     <description>Receive Buffer Interrupt</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXF</name>
                     <description>Receive Frame Interrupt</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXB</name>
                     <description>Transmit Buffer Interrupt</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXF</name>
                     <description>Transmit Frame Interrupt</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GRA</name>
                     <description>Graceful Stop Complete</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BABT</name>
                     <description>Babbling Transmit Error</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BABR</name>
                     <description>Babbling Receive Error</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EIMR</name>
               <description>Interrupt Mask Register</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>TS_TIMER</name>
                     <description>TS_TIMER Interrupt Mask</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TS_AVAIL</name>
                     <description>TS_AVAIL Interrupt Mask</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAKEUP</name>
                     <description>WAKEUP Interrupt Mask</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLR</name>
                     <description>PLR Interrupt Mask</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UN</name>
                     <description>UN Interrupt Mask</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RL</name>
                     <description>RL Interrupt Mask</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LC</name>
                     <description>LC Interrupt Mask</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EBERR</name>
                     <description>EBERR Interrupt Mask</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MII</name>
                     <description>MII Interrupt Mask</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXB</name>
                     <description>RXB Interrupt Mask</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXF</name>
                     <description>RXF Interrupt Mask</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXB</name>
                     <description>TXB Interrupt Mask</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The corresponding interrupt source is masked</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The corresponding interrupt source is not masked</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TXB" > <name>TXF</name> <description>TXF Interrupt Mask</description> <bitOffset>27</bitOffset> </field>
                  <field derivedFrom="TXB" > <name>GRA</name> <description>GRA Interrupt Mask</description> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="TXB" > <name>BABT</name> <description>BABT Interrupt Mask</description> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="TXB" > <name>BABR</name> <description>BABR Interrupt Mask</description> <bitOffset>30</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>RDAR</name>
               <description>Receive Descriptor Active Register</description>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>RDAR</name>
                     <description>Receive Descriptor Active</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TDAR</name>
               <description>Transmit Descriptor Active Register</description>
               <addressOffset>0x14</addressOffset>
               <fields>
                  <field>
                     <name>TDAR</name>
                     <description>Transmit Descriptor Active</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECR</name>
               <description>Ethernet Control Register</description>
               <addressOffset>0x24</addressOffset>
               <resetValue>0xF0000000</resetValue>
               <fields>
                  <field>
                     <name>RESET</name>
                     <description>Ethernet MAC Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ETHEREN</name>
                     <description>Ethernet Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Reception immediately stops and transmission stops after a bad CRC is appended to any currently transmitted frame</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>MAC is enabled, and reception and transmission are possible</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MAGICEN</name>
                     <description>Magic Packet Detection Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Magic detection logic disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The MAC core detects magic packets and asserts EIR[WAKEUP] when a frame is detected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SLEEP</name>
                     <description>Sleep Mode Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Normal operating mode</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Sleep mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EN1588</name>
                     <description>EN1588 Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Legacy FEC buffer descriptors and functions enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enhanced frame time-stamping functions enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DBGEN</name>
                     <description>Debug Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>MAC continues operation in debug mode</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>MAC enters hardware freeze mode when the processor is in debug mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DBSWP</name>
                     <description>Descriptor Byte Swapping Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The buffer descriptor bytes are not swapped to support big-endian devices</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The buffer descriptor bytes are swapped to support little-endian devices</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MMFR</name>
               <description>MII Management Frame Register</description>
               <addressOffset>0x40</addressOffset>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Management Frame Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>TA</name>
                     <description>Turn Around</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RA</name>
                     <description>Register Address</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PA</name>
                     <description>PHY Address</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OP</name>
                     <description>Operation Code</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Write frame operation, but not MII compliant</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Write frame operation for a valid MII management frame</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Read frame operation for a valid MII management frame</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Read frame operation, but not MII compliant</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ST</name>
                     <description>Start Of Frame Delimiter</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
