podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/ENET_S32K148.svd.xml
            <register derivedFrom="RMON_T_DROP"> <name>RMON_R_RESVD_0</name> <addressOffset>0x2A4</addressOffset> </register>
            <register>
               <name>RMON_R_P64</name>
               <description>Rx 64-Byte Packets Statistic Register</description>
               <addressOffset>0x2A8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Number of 64-byte receive packets</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RMON_R_P65TO127</name>
               <description>Rx 65- to 127-Byte Packets Statistic Register</description>
               <addressOffset>0x2AC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Number of 65- to 127-byte recieve packets</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RMON_R_P128TO255</name>
               <description>Rx 128- to 255-Byte Packets Statistic Register</description>
               <addressOffset>0x2B0</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Number of 128- to 255-byte recieve packets</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RMON_R_P256TO511</name>
               <description>Rx 256- to 511-Byte Packets Statistic Register</description>
               <addressOffset>0x2B4</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Number of 256- to 511-byte recieve packets</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RMON_R_P512TO1023</name>
               <description>Rx 512- to 1023-Byte Packets Statistic Register</description>
               <addressOffset>0x2B8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Number of 512- to 1023-byte recieve packets</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RMON_R_P1024TO2047</name>
               <description>Rx 1024- to 2047-Byte Packets Statistic Register</description>
               <addressOffset>0x2BC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Number of 1024- to 2047-byte recieve packets</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RMON_R_P_GTE2048</name>
               <description>Rx Packets Greater than 2048 Bytes Statistic Register</description>
               <addressOffset>0x2C0</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Number of greater-than-2048-byte recieve packets</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RMON_R_OCTETS</name>
               <description>Rx Octets Statistic Register</description>
               <addressOffset>0x2C4</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Number of receive octets</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEEE_R_DROP</name>
               <description>Frames not Counted Correctly Statistic Register</description>
               <addressOffset>0x2C8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Frame count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEEE_R_FRAME_OK</name>
               <description>Frames Received OK Statistic Register</description>
               <addressOffset>0x2CC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Number of frames received OK</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEEE_R_CRC</name>
               <description>Frames Received with CRC Error Statistic Register</description>
               <addressOffset>0x2D0</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Number of frames received with CRC error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEEE_R_ALIGN</name>
               <description>Frames Received with Alignment Error Statistic Register</description>
               <addressOffset>0x2D4</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Number of frames received with alignment error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEEE_R_MACERR</name>
               <description>Receive FIFO Overflow Count Statistic Register</description>
               <addressOffset>0x2D8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Receive FIFO overflow count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEEE_R_FDXFC</name>
               <description>Flow Control Pause Frames Received Statistic Register</description>
               <addressOffset>0x2DC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Number of flow-control pause frames received</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEEE_R_OCTETS_OK</name>
               <description>Octet Count for Frames Received without Error Statistic Register</description>
               <addressOffset>0x2E0</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Number of octets for frames received without error</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>ATCR</name>
               <description>Adjustable Timer Control Register</description>
               <addressOffset>0x400</addressOffset>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>Enable Timer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The timer stops at the current value</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The timer starts incrementing</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OFFEN</name>
                     <description>Enable One-Shot Offset Event</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disable</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The timer can be reset to zero when the given offset time is reached (offset event). The field is cleared when the offset event is reached, so no further event occurs until the field is set again. The timer offset value must be set before setting this field</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OFFRST</name>
                     <description>Reset Timer On Offset Event</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The timer is not affected and no action occurs, besides clearing OFFEN, when the offset is reached</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>If OFFEN is set, the timer resets to zero when the offset setting is reached. The offset event does not cause a timer interrupt</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PEREN</name>
                     <description>Enable Periodical Event</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disable</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>A period event interrupt can be generated (EIR[TS_TIMER]) and the event signal output is asserted when the timer wraps around according to the periodic setting ATPER. The timer period value must be set before setting this bit. Not all devices contain the event signal output. See the chip configuration details</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PINPER</name>
                     <description>Enables event signal output assertion on period event</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disable</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enable</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RESTART</name>
                     <description>Reset Timer</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPTURE</name>
                     <description>Capture Timer Value</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No effect</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The current time is captured and can be read from the ATVR register</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SLAVE</name>
                     <description>Enable Timer Slave Mode</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The timer is active and all configuration fields in this register are relevant</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The internal timer is disabled and the externally provided timer value is used. All other fields, except CAPTURE, in this register have no effect. CAPTURE can still be used to capture the current timer value</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ATVR</name>
               <description>Timer Value Register</description>
               <addressOffset>0x404</addressOffset>
               <fields>
                  <field>
                     <name>ATIME</name>
                     <description>A write sets the timer. A read returns the last captured value. To read the current value, issue a capture command (set ATCR[CAPTURE]) prior to reading this register</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>ATOFF</name>
               <description>Timer Offset Register</description>
               <addressOffset>0x408</addressOffset>
               <fields>
                  <field>
                     <name>OFFSET</name>
                     <description>Offset value for one-shot event generation. When the timer reaches the value an event can be generated to reset the counter. If the increment value in ATINC is given in true nanoseconds, this value is also given in true nanoseconds</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>ATPER</name>
               <description>Timer Period Register</description>
               <addressOffset>0x40C</addressOffset>
               <resetValue>0x3B9ACA00</resetValue>
               <fields>
                  <field>
                     <name>PERIOD</name>
                     <description>Value for generating periodic events. Each instance the timer reaches this value, the period event occurs and the timer restarts. If the increment value in ATINC is given in true nanoseconds, this value is also given in true nanoseconds. The value should be initialized to 1,000,000,000 (1 x 10 9 ) to represent a timer wrap around of one second. The increment value set in ATINC should be set to the true nanoseconds of the period of clock ts_clk, hence implementing a true 1 second counter</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>ATCOR</name>
               <description>Timer Correction Register</description>
               <addressOffset>0x410</addressOffset>
               <fields>
                  <field>
                     <name>COR</name>
                     <description>Correction Counter Wrap-Around Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>31</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ATINC</name>
               <description>Time-Stamping Clock Period Register</description>
               <addressOffset>0x414</addressOffset>
               <fields>
                  <field>
                     <name>INC</name>
                     <description>Clock Period Of The Timestamping Clock (ts_clk) In Nanoseconds</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>INC_CORR</name>
                     <description>Correction Increment Value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ATSTMP</name>
               <description>Timestamp of Last Transmitted Frame</description>
               <addressOffset>0x418</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TIMESTAMP</name>
                     <description>Timestamp of the last frame transmitted by the core that had TxBD[TS] set . This register is only valid when EIR[TS_AVAIL] is set</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
