podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/ENET_S32K148.svd.xml
            <register>
               <name>TGSR</name>
               <description>Timer Global Status Register</description>
               <addressOffset>0x604</addressOffset>
               <fields>
                  <field>
                     <name>TF0</name>
                     <description>Copy of Timer Flag for channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Timer Flag for Channel 0 is clear</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Timer Flag for Channel 0 is set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TF1</name>
                     <description>Copy of Timer Flag for channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Timer Flag for Channel 1 is clear</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Timer Flag for Channel 1 is set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TF2</name>
                     <description>Copy of Timer Flag for channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Timer Flag for Channel 2 is clear</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Timer Flag for Channel 2 is set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TF3</name>
                     <description>Copy of Timer Flag for channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Timer Flag for Channel 3 is clear</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Timer Flag for Channel 3 is set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TCSR0</name>
               <description>Timer Control Status Register</description>
               <addressOffset>0x608</addressOffset>
               <fields>
                  <field>
                     <name>TDRE</name>
                     <description>Timer DMA Request Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>DMA request is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>DMA request is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TMODE</name>
                     <description>Timer Mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0000</name>
                           <description>Timer Channel is disabled</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>Timer Channel is configured for Input Capture on rising edge</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0010</name>
                           <description>Timer Channel is configured for Input Capture on falling edge</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>Timer Channel is configured for Input Capture on both edges</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0100</name>
                           <description>Timer Channel is configured for Output Compare - software only</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0101</name>
                           <description>Timer Channel is configured for Output Compare - toggle output on compare</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0110</name>
                           <description>Timer Channel is configured for Output Compare - clear output on compare</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0111</name>
                           <description>Timer Channel is configured for Output Compare - set output on compare</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1000</name>
                           <description>Reserved</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1010</name>
                           <description>Timer Channel is configured for Output Compare - clear output on compare, set output on overflow</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1100</name>
                           <description>Reserved</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1110</name>
                           <description>Timer Channel is configured for Output Compare - pulse output low on compare for one 1588 clock cycle</description>
                           <value>0b1110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1111</name>
                           <description>Timer Channel is configured for Output Compare - pulse output high on compare for one 1588 clock cycle</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TIE</name>
                     <description>Timer Interrupt Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Interrupt is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Interrupt is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TF</name>
                     <description>Timer Flag</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Input Capture or Output Compare has not occurred</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Input Capture or Output Compare has occurred</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TCCR0</name>
               <description>Timer Compare Capture Register</description>
               <addressOffset>0x60C</addressOffset>
               <fields>
                  <field>
                     <name>TCC</name>
                     <description>Timer Capture Compare</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register derivedFrom="TCSR0"> <name>TCSR1</name> <addressOffset>0x610</addressOffset> </register>
            <register derivedFrom="TCCR0"> <name>TCCR1</name> <addressOffset>0x614</addressOffset> </register>
            <register derivedFrom="TCSR0"> <name>TCSR2</name> <addressOffset>0x618</addressOffset> </register>
            <register derivedFrom="TCCR0"> <name>TCCR2</name> <addressOffset>0x61C</addressOffset> </register>
            <register derivedFrom="TCSR0"> <name>TCSR3</name> <addressOffset>0x620</addressOffset> </register>
            <register derivedFrom="TCCR0"> <name>TCCR3</name> <addressOffset>0x624</addressOffset> </register>
         </registers>
      </peripheral>
